ErichStyger/mcuoneclipse/Examples/KDS/FRDM-KE06Z/FRDM-KE06Z_FlashPrg/Static_Code/IO_Map/MKE06Z4.h
/** MCM - Peripheral register structure */
typedef struct MCM_MemMap {
  uint8_t RESERVED_0[8];
  uint16_t PLASC;                                  /**< Crossbar Switch (AXBS) Slave Configuration, offset: 0x8 */
  uint16_t PLAMC;                                  /**< Crossbar Switch (AXBS) Master Configuration, offset: 0xA */
  uint32_t PLACR;                                  /**< Platform Control Register, offset: 0xC */
} volatile *MCM_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- MCM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MCM_Register_Accessor_Macros MCM - Register accessor macros
 * @{
 */


/* MCM - Register accessors */
#define MCM_PLASC_REG(base)                      ((base)->PLASC)
#define MCM_PLAMC_REG(base)                      ((base)->PLAMC)
#define MCM_PLACR_REG(base)                      ((base)->PLACR)

/*!
 * @}
 */ /* end of group MCM_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- MCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MCM_Register_Masks MCM Register Masks
 * @{
 */

/* PLASC Bit Fields */
#define MCM_PLASC_ASC_MASK                       0xFFu
#define MCM_PLASC_ASC_SHIFT                      0
#define MCM_PLASC_ASC(x)                         (((uint16_t)(((uint16_t)(x))<<MCM_PLASC_ASC_SHIFT))&MCM_PLASC_ASC_MASK)
/* PLAMC Bit Fields */
#define MCM_PLAMC_AMC_MASK                       0xFFu
#define MCM_PLAMC_AMC_SHIFT                      0
#define MCM_PLAMC_AMC(x)                         (((uint16_t)(((uint16_t)(x))<<MCM_PLAMC_AMC_SHIFT))&MCM_PLAMC_AMC_MASK)
/* PLACR Bit Fields */
#define MCM_PLACR_CFCC_MASK                      0x400u
#define MCM_PLACR_CFCC_SHIFT                     10
#define MCM_PLACR_DFCDA_MASK                     0x800u
#define MCM_PLACR_DFCDA_SHIFT                    11
#define MCM_PLACR_DFCIC_MASK                     0x1000u
#define MCM_PLACR_DFCIC_SHIFT                    12
#define MCM_PLACR_DFCC_MASK                      0x2000u
#define MCM_PLACR_DFCC_SHIFT                     13
#define MCM_PLACR_EFDS_MASK                      0x4000u
#define MCM_PLACR_EFDS_SHIFT                     14
#define MCM_PLACR_DFCS_MASK                      0x8000u
#define MCM_PLACR_DFCS_SHIFT                     15
#define MCM_PLACR_ESFC_MASK                      0x10000u
#define MCM_PLACR_ESFC_SHIFT                     16

/*!
 * @}
 */ /* end of group MCM_Register_Masks */


/* MCM - Peripheral instance base addresses */
/** Peripheral MCM base pointer */
#define MCM_BASE_PTR                             ((MCM_MemMapPtr)0xF0003000u)
/** Array initializer of MCM peripheral base pointers */
#define MCM_BASE_PTRS                            { MCM_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- MCM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MCM_Register_Accessor_Macros MCM - Register accessor macros
 * @{
 */


/* MCM - Register instance definitions */
/* MCM */
#define MCM_PLASC                                MCM_PLASC_REG(MCM_BASE_PTR)
#define MCM_PLAMC                                MCM_PLAMC_REG(MCM_BASE_PTR)
#define MCM_PLACR                                MCM_PLACR_REG(MCM_BASE_PTR)

/*!
 * @}
 */ /* end of group MCM_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group MCM_Peripheral */


/* ----------------------------------------------------------------------------
   -- MSCAN
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MSCAN_Peripheral MSCAN
 * @{
 */

/** MSCAN - Peripheral register structure */
typedef struct MSCAN_MemMap {
  uint8_t CANCTL0;                                 /**< MSCAN Control Register 0, offset: 0x0 */
  uint8_t CANCTL1;                                 /**< MSCAN Control Register 1, offset: 0x1 */
  uint8_t CANBTR0;                                 /**< MSCAN Bus Timing Register 0, offset: 0x2 */
  uint8_t CANBTR1;                                 /**< MSCAN Bus Timing Register 1, offset: 0x3 */
  uint8_t CANRFLG;                                 /**< MSCAN Receiver Flag Register, offset: 0x4 */
  uint8_t CANRIER;                                 /**< MSCAN Receiver Interrupt Enable Register, offset: 0x5 */
  uint8_t CANTFLG;                                 /**< MSCAN Transmitter Flag Register, offset: 0x6 */
  uint8_t CANTIER;                                 /**< MSCAN Transmitter Interrupt Enable Register, offset: 0x7 */
  uint8_t CANTARQ;                                 /**< MSCAN Transmitter Message Abort Request Register, offset: 0x8 */
  uint8_t CANTAAK;                                 /**< MSCAN Transmitter Message Abort Acknowledge Register, offset: 0x9 */
  uint8_t CANTBSEL;                                /**< MSCAN Transmit Buffer Selection Register, offset: 0xA */
  uint8_t CANIDAC;                                 /**< MSCAN Identifier Acceptance Control Register, offset: 0xB */
  uint8_t RESERVED_0[1];
  uint8_t CANMISC;                                 /**< MSCAN Miscellaneous Register, offset: 0xD */
  uint8_t CANRXERR;                                /**< MSCAN Receive Error Counter, offset: 0xE */
  uint8_t CANTXERR;                                /**< MSCAN Transmit Error Counter, offset: 0xF */
  uint8_t CANIDAR_BANK_1[4];                       /**< MSCAN Identifier Acceptance Register n of First Bank, array offset: 0x10, array step: 0x1 */
  uint8_t CANIDMR_BANK_1[4];                       /**< MSCAN Identifier Mask Register n of First Bank, array offset: 0x14, array step: 0x1 */
  uint8_t CANIDAR_BANK_2[4];                       /**< MSCAN Identifier Acceptance Register n of Second Bank, array offset: 0x18, array step: 0x1 */
  uint8_t CANIDMR_BANK_2[4];                       /**< MSCAN Identifier Mask Register n of Second Bank, array offset: 0x1C, array step: 0x1 */
  union {                                          /* offset: 0x20 */
    uint8_t REIDR0;                                  /**< Receive Extended Identifier Register 0, offset: 0x20 */
    uint8_t RSIDR0;                                  /**< Receive Standard Identifier Register 0, offset: 0x20 */
  };
  union {                                          /* offset: 0x21 */
    uint8_t REIDR1;                                  /**< Receive Extended Identifier Register 1, offset: 0x21 */
    uint8_t RSIDR1;                                  /**< Standard Identifier Register 1, offset: 0x21 */
  };
  uint8_t REIDR2;                                  /**< Receive Extended Identifier Register 2, offset: 0x22 */
  uint8_t REIDR3;                                  /**< Receive Extended Identifier Register 3, offset: 0x23 */
  uint8_t REDSR[8];                                /**< Receive Extended Data Segment Register N, array offset: 0x24, array step: 0x1 */
  uint8_t RDLR;                                    /**< Receive Data Length Register, offset: 0x2C */
  uint8_t RESERVED_1[1];
  uint8_t RTSRH;                                   /**< Receive Time Stamp Register High, offset: 0x2E */
  uint8_t RTSRL;                                   /**< Receive Time Stamp Register Low, offset: 0x2F */
  union {                                          /* offset: 0x30 */
    uint8_t TEIDR0;                                  /**< Transmit Extended Identifier Register 0, offset: 0x30 */
    uint8_t TSIDR0;                                  /**< Transmit Standard Identifier Register 0, offset: 0x30 */
  };
  union {                                          /* offset: 0x31 */
    uint8_t TEIDR1;                                  /**< Transmit Extended Identifier Register 1, offset: 0x31 */
    uint8_t TSIDR1;                                  /**< Transmit Standard Identifier Register 1, offset: 0x31 */
  };
  uint8_t TEIDR2;                                  /**< Transmit Extended Identifier Register 2, offset: 0x32 */
  uint8_t TEIDR3;                                  /**< Transmit Extended Identifier Register 3, offset: 0x33 */
  uint8_t TEDSR[8];                                /**< Transmit Extended Data Segment Register N, array offset: 0x34, array step: 0x1 */
  uint8_t TDLR;                                    /**< This register keeps the data length field of the CAN frame., offset: 0x3C */
  uint8_t TBPR;                                    /**< Transmit Buffer Priority Register, offset: 0x3D */
  uint8_t TTSRH;                                   /**< Transmit Time Stamp Register High, offset: 0x3E */
  uint8_t TTSRL;                                   /**< Transmit Time Stamp Register Low, offset: 0x3F */
} volatile *MSCAN_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- MSCAN - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MSCAN_Register_Accessor_Macros MSCAN - Register accessor macros
 * @{
 */


