ErichStyger/mcuoneclipse/Examples/KDS/FRDM-KE06Z/FRDM-KE06Z_FlashPrg/Static_Code/IO_Map/MKE06Z4.h
/* MSCAN - Register instance definitions */
/* MSCAN */
#define MSCAN_CANCTL0                            MSCAN_CANCTL0_REG(MSCAN_BASE_PTR)
#define MSCAN_CANCTL1                            MSCAN_CANCTL1_REG(MSCAN_BASE_PTR)
#define MSCAN_CANBTR0                            MSCAN_CANBTR0_REG(MSCAN_BASE_PTR)
#define MSCAN_CANBTR1                            MSCAN_CANBTR1_REG(MSCAN_BASE_PTR)
#define MSCAN_CANRFLG                            MSCAN_CANRFLG_REG(MSCAN_BASE_PTR)
#define MSCAN_CANRIER                            MSCAN_CANRIER_REG(MSCAN_BASE_PTR)
#define MSCAN_CANTFLG                            MSCAN_CANTFLG_REG(MSCAN_BASE_PTR)
#define MSCAN_CANTIER                            MSCAN_CANTIER_REG(MSCAN_BASE_PTR)
#define MSCAN_CANTARQ                            MSCAN_CANTARQ_REG(MSCAN_BASE_PTR)
#define MSCAN_CANTAAK                            MSCAN_CANTAAK_REG(MSCAN_BASE_PTR)
#define MSCAN_CANTBSEL                           MSCAN_CANTBSEL_REG(MSCAN_BASE_PTR)
#define MSCAN_CANIDAC                            MSCAN_CANIDAC_REG(MSCAN_BASE_PTR)
#define MSCAN_CANMISC                            MSCAN_CANMISC_REG(MSCAN_BASE_PTR)
#define MSCAN_CANRXERR                           MSCAN_CANRXERR_REG(MSCAN_BASE_PTR)
#define MSCAN_CANTXERR                           MSCAN_CANTXERR_REG(MSCAN_BASE_PTR)
#define MSCAN_CANIDAR0                           MSCAN_CANIDAR_BANK_1_REG(MSCAN_BASE_PTR,0)
#define MSCAN_CANIDAR1                           MSCAN_CANIDAR_BANK_1_REG(MSCAN_BASE_PTR,1)
#define MSCAN_CANIDAR2                           MSCAN_CANIDAR_BANK_1_REG(MSCAN_BASE_PTR,2)
#define MSCAN_CANIDAR3                           MSCAN_CANIDAR_BANK_1_REG(MSCAN_BASE_PTR,3)
#define MSCAN_CANIDMR0                           MSCAN_CANIDMR_BANK_1_REG(MSCAN_BASE_PTR,0)
#define MSCAN_CANIDMR1                           MSCAN_CANIDMR_BANK_1_REG(MSCAN_BASE_PTR,1)
#define MSCAN_CANIDMR2                           MSCAN_CANIDMR_BANK_1_REG(MSCAN_BASE_PTR,2)
#define MSCAN_CANIDMR3                           MSCAN_CANIDMR_BANK_1_REG(MSCAN_BASE_PTR,3)
#define MSCAN_CANIDAR4                           MSCAN_CANIDAR_BANK_2_REG(MSCAN_BASE_PTR,0)
#define MSCAN_CANIDAR5                           MSCAN_CANIDAR_BANK_2_REG(MSCAN_BASE_PTR,1)
#define MSCAN_CANIDAR6                           MSCAN_CANIDAR_BANK_2_REG(MSCAN_BASE_PTR,2)
#define MSCAN_CANIDAR7                           MSCAN_CANIDAR_BANK_2_REG(MSCAN_BASE_PTR,3)
#define MSCAN_CANIDMR4                           MSCAN_CANIDMR_BANK_2_REG(MSCAN_BASE_PTR,0)
#define MSCAN_CANIDMR5                           MSCAN_CANIDMR_BANK_2_REG(MSCAN_BASE_PTR,1)
#define MSCAN_CANIDMR6                           MSCAN_CANIDMR_BANK_2_REG(MSCAN_BASE_PTR,2)
#define MSCAN_CANIDMR7                           MSCAN_CANIDMR_BANK_2_REG(MSCAN_BASE_PTR,3)
#define MSCAN_REIDR0                             MSCAN_REIDR0_REG(MSCAN_BASE_PTR)
#define MSCAN_RSIDR0                             MSCAN_RSIDR0_REG(MSCAN_BASE_PTR)
#define MSCAN_REIDR1                             MSCAN_REIDR1_REG(MSCAN_BASE_PTR)
#define MSCAN_RSIDR1                             MSCAN_RSIDR1_REG(MSCAN_BASE_PTR)
#define MSCAN_REIDR2                             MSCAN_REIDR2_REG(MSCAN_BASE_PTR)
#define MSCAN_REIDR3                             MSCAN_REIDR3_REG(MSCAN_BASE_PTR)
#define MSCAN_REDSR0                             MSCAN_REDSR_REG(MSCAN_BASE_PTR,0)
#define MSCAN_REDSR1                             MSCAN_REDSR_REG(MSCAN_BASE_PTR,1)
#define MSCAN_REDSR2                             MSCAN_REDSR_REG(MSCAN_BASE_PTR,2)
#define MSCAN_REDSR3                             MSCAN_REDSR_REG(MSCAN_BASE_PTR,3)
#define MSCAN_REDSR4                             MSCAN_REDSR_REG(MSCAN_BASE_PTR,4)
#define MSCAN_REDSR5                             MSCAN_REDSR_REG(MSCAN_BASE_PTR,5)
#define MSCAN_REDSR6                             MSCAN_REDSR_REG(MSCAN_BASE_PTR,6)
#define MSCAN_REDSR7                             MSCAN_REDSR_REG(MSCAN_BASE_PTR,7)
#define MSCAN_RDLR                               MSCAN_RDLR_REG(MSCAN_BASE_PTR)
#define MSCAN_RTSRH                              MSCAN_RTSRH_REG(MSCAN_BASE_PTR)
#define MSCAN_RTSRL                              MSCAN_RTSRL_REG(MSCAN_BASE_PTR)
#define MSCAN_TEIDR0                             MSCAN_TEIDR0_REG(MSCAN_BASE_PTR)
#define MSCAN_TSIDR0                             MSCAN_TSIDR0_REG(MSCAN_BASE_PTR)
#define MSCAN_TEIDR1                             MSCAN_TEIDR1_REG(MSCAN_BASE_PTR)
#define MSCAN_TSIDR1                             MSCAN_TSIDR1_REG(MSCAN_BASE_PTR)
#define MSCAN_TEIDR2                             MSCAN_TEIDR2_REG(MSCAN_BASE_PTR)
#define MSCAN_TEIDR3                             MSCAN_TEIDR3_REG(MSCAN_BASE_PTR)
#define MSCAN_TEDSR0                             MSCAN_TEDSR_REG(MSCAN_BASE_PTR,0)
#define MSCAN_TEDSR1                             MSCAN_TEDSR_REG(MSCAN_BASE_PTR,1)
#define MSCAN_TEDSR2                             MSCAN_TEDSR_REG(MSCAN_BASE_PTR,2)
#define MSCAN_TEDSR3                             MSCAN_TEDSR_REG(MSCAN_BASE_PTR,3)
#define MSCAN_TEDSR4                             MSCAN_TEDSR_REG(MSCAN_BASE_PTR,4)
#define MSCAN_TEDSR5                             MSCAN_TEDSR_REG(MSCAN_BASE_PTR,5)
#define MSCAN_TEDSR6                             MSCAN_TEDSR_REG(MSCAN_BASE_PTR,6)
#define MSCAN_TEDSR7                             MSCAN_TEDSR_REG(MSCAN_BASE_PTR,7)
#define MSCAN_TDLR                               MSCAN_TDLR_REG(MSCAN_BASE_PTR)
#define MSCAN_TBPR                               MSCAN_TBPR_REG(MSCAN_BASE_PTR)
#define MSCAN_TTSRH                              MSCAN_TTSRH_REG(MSCAN_BASE_PTR)
#define MSCAN_TTSRL                              MSCAN_TTSRL_REG(MSCAN_BASE_PTR)

/* MSCAN - Register array accessors */
#define MSCAN_CANIDAR_BANK_1(index)              MSCAN_CANIDAR_BANK_1_REG(MSCAN_BASE_PTR,index)
#define MSCAN_CANIDMR_BANK_1(index)              MSCAN_CANIDMR_BANK_1_REG(MSCAN_BASE_PTR,index)
#define MSCAN_CANIDAR_BANK_2(index)              MSCAN_CANIDAR_BANK_2_REG(MSCAN_BASE_PTR,index)
#define MSCAN_CANIDMR_BANK_2(index)              MSCAN_CANIDMR_BANK_2_REG(MSCAN_BASE_PTR,index)
#define MSCAN_REDSR(index)                       MSCAN_REDSR_REG(MSCAN_BASE_PTR,index)
#define MSCAN_TEDSR(index)                       MSCAN_TEDSR_REG(MSCAN_BASE_PTR,index)

/*!
 * @}
 */ /* end of group MSCAN_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group MSCAN_Peripheral */


/* ----------------------------------------------------------------------------
   -- NV
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NV_Peripheral NV
 * @{
 */

/** NV - Peripheral register structure */
typedef struct NV_MemMap {
  uint8_t BACKKEY0;                                /**< Backdoor Comparison Key 0, offset: 0x0 */
  uint8_t BACKKEY1;                                /**< Backdoor Comparison Key 1, offset: 0x1 */
  uint8_t BACKKEY2;                                /**< Backdoor Comparison Key 2, offset: 0x2 */
  uint8_t BACKKEY3;                                /**< Backdoor Comparison Key 3, offset: 0x3 */
  uint8_t BACKKEY4;                                /**< Backdoor Comparison Key 4, offset: 0x4 */
  uint8_t BACKKEY5;                                /**< Backdoor Comparison Key 5, offset: 0x5 */
  uint8_t BACKKEY6;                                /**< Backdoor Comparison Key 6, offset: 0x6 */
  uint8_t BACKKEY7;                                /**< Backdoor Comparison Key 7, offset: 0x7 */
  uint8_t RESERVED_0[5];
  uint8_t FPROT;                                   /**< Non-volatile P-Flash Protection Register, offset: 0xD */
  uint8_t FSEC;                                    /**< Non-volatile Flash Security Register, offset: 0xE */
  uint8_t FOPT;                                    /**< Non-volatile Flash Option Register, offset: 0xF */
} volatile *NV_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- NV - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NV_Register_Accessor_Macros NV - Register accessor macros
 * @{
 */


/* NV - Register accessors */
#define NV_BACKKEY0_REG(base)                    ((base)->BACKKEY0)
#define NV_BACKKEY1_REG(base)                    ((base)->BACKKEY1)
#define NV_BACKKEY2_REG(base)                    ((base)->BACKKEY2)
#define NV_BACKKEY3_REG(base)                    ((base)->BACKKEY3)
#define NV_BACKKEY4_REG(base)                    ((base)->BACKKEY4)
#define NV_BACKKEY5_REG(base)                    ((base)->BACKKEY5)
#define NV_BACKKEY6_REG(base)                    ((base)->BACKKEY6)
#define NV_BACKKEY7_REG(base)                    ((base)->BACKKEY7)
#define NV_FPROT_REG(base)                       ((base)->FPROT)
#define NV_FSEC_REG(base)                        ((base)->FSEC)
#define NV_FOPT_REG(base)                        ((base)->FOPT)

/*!
 * @}
 */ /* end of group NV_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- NV Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup NV_Register_Masks NV Register Masks
 * @{
 */

/* BACKKEY0 Bit Fields */
#define NV_BACKKEY0_KEY_MASK                     0xFFu
#define NV_BACKKEY0_KEY_SHIFT                    0
#define NV_BACKKEY0_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY0_KEY_SHIFT))&NV_BACKKEY0_KEY_MASK)
/* BACKKEY1 Bit Fields */
#define NV_BACKKEY1_KEY_MASK                     0xFFu
#define NV_BACKKEY1_KEY_SHIFT                    0
#define NV_BACKKEY1_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY1_KEY_SHIFT))&NV_BACKKEY1_KEY_MASK)
/* BACKKEY2 Bit Fields */
#define NV_BACKKEY2_KEY_MASK                     0xFFu
#define NV_BACKKEY2_KEY_SHIFT                    0
#define NV_BACKKEY2_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY2_KEY_SHIFT))&NV_BACKKEY2_KEY_MASK)
/* BACKKEY3 Bit Fields */
#define NV_BACKKEY3_KEY_MASK                     0xFFu
#define NV_BACKKEY3_KEY_SHIFT                    0
#define NV_BACKKEY3_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY3_KEY_SHIFT))&NV_BACKKEY3_KEY_MASK)
/* BACKKEY4 Bit Fields */
#define NV_BACKKEY4_KEY_MASK                     0xFFu
#define NV_BACKKEY4_KEY_SHIFT                    0
#define NV_BACKKEY4_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY4_KEY_SHIFT))&NV_BACKKEY4_KEY_MASK)
/* BACKKEY5 Bit Fields */
#define NV_BACKKEY5_KEY_MASK                     0xFFu
#define NV_BACKKEY5_KEY_SHIFT                    0
#define NV_BACKKEY5_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY5_KEY_SHIFT))&NV_BACKKEY5_KEY_MASK)
/* BACKKEY6 Bit Fields */
#define NV_BACKKEY6_KEY_MASK                     0xFFu
#define NV_BACKKEY6_KEY_SHIFT                    0
#define NV_BACKKEY6_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY6_KEY_SHIFT))&NV_BACKKEY6_KEY_MASK)
/* BACKKEY7 Bit Fields */
#define NV_BACKKEY7_KEY_MASK                     0xFFu
#define NV_BACKKEY7_KEY_SHIFT                    0
#define NV_BACKKEY7_KEY(x)                       (((uint8_t)(((uint8_t)(x))<<NV_BACKKEY7_KEY_SHIFT))&NV_BACKKEY7_KEY_MASK)
/* FPROT Bit Fields */
#define NV_FPROT_FPLS_MASK                       0x3u
#define NV_FPROT_FPLS_SHIFT                      0
#define NV_FPROT_FPLS(x)                         (((uint8_t)(((uint8_t)(x))<<NV_FPROT_FPLS_SHIFT))&NV_FPROT_FPLS_MASK)
#define NV_FPROT_FPLDIS_MASK                     0x4u
#define NV_FPROT_FPLDIS_SHIFT                    2
#define NV_FPROT_FPHS_MASK                       0x18u
#define NV_FPROT_FPHS_SHIFT                      3
#define NV_FPROT_FPHS(x)                         (((uint8_t)(((uint8_t)(x))<<NV_FPROT_FPHS_SHIFT))&NV_FPROT_FPHS_MASK)
#define NV_FPROT_FPHDIS_MASK                     0x20u
#define NV_FPROT_FPHDIS_SHIFT                    5
#define NV_FPROT_FPOPEN_MASK                     0x80u
#define NV_FPROT_FPOPEN_SHIFT                    7
/* FSEC Bit Fields */
#define NV_FSEC_SEC_MASK                         0x3u
#define NV_FSEC_SEC_SHIFT                        0
#define NV_FSEC_SEC(x)                           (((uint8_t)(((uint8_t)(x))<<NV_FSEC_SEC_SHIFT))&NV_FSEC_SEC_MASK)
#define NV_FSEC_KEYEN_MASK                       0xC0u
#define NV_FSEC_KEYEN_SHIFT                      6
#define NV_FSEC_KEYEN(x)                         (((uint8_t)(((uint8_t)(x))<<NV_FSEC_KEYEN_SHIFT))&NV_FSEC_KEYEN_MASK)

/*!
 * @}
 */ /* end of group NV_Register_Masks */


