ErichStyger/mcuoneclipse/Examples/KDS/FRDM-KE06Z/FRDM-KE06Z_FlashPrg/Static_Code/IO_Map/MKE06Z4.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_defines */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define NVIC_ISER_SETENA_MASK        This_symbol_has_been_deprecated
#define NVIC_ISER_SETENA_SHIFT       This_symbol_has_been_deprecated
#define NVIC_ISER_SETENA(x)          This_symbol_has_been_deprecated
#define NVIC_ICER_CLRENA_MASK        This_symbol_has_been_deprecated
#define NVIC_ICER_CLRENA_SHIFT       This_symbol_has_been_deprecated
#define NVIC_ICER_CLRENA(x)          This_symbol_has_been_deprecated
#define NVIC_ISPR_SETPEND_MASK       This_symbol_has_been_deprecated
#define NVIC_ISPR_SETPEND_SHIFT      This_symbol_has_been_deprecated
#define NVIC_ISPR_SETPEND(x)         This_symbol_has_been_deprecated
#define NVIC_ICPR_CLRPEND_MASK       This_symbol_has_been_deprecated
#define NVIC_ICPR_CLRPEND_SHIFT      This_symbol_has_been_deprecated
#define NVIC_ICPR_CLRPEND(x)         This_symbol_has_been_deprecated
#define SCB_ICSR_VECTACTIVE_MASK     This_symbol_has_been_deprecated
#define SCB_ICSR_VECTACTIVE_SHIFT    This_symbol_has_been_deprecated
#define SCB_ICSR_VECTACTIVE(x)       This_symbol_has_been_deprecated
#define SCB_ICSR_ISRPENDING_MASK     This_symbol_has_been_deprecated
#define SCB_ICSR_ISRPENDING_SHIFT    This_symbol_has_been_deprecated
#define INT_LVD_LVW                  INT_PMC
#define INT_ADC0                     INT_ADC
#define MSCAN_TDLR_DLC_MASK          MSCAN_TDLR_TDLC_MASK
#define MSCAN_TDLR_DLC_SHIFT         MSCAN_TDLR_TDLC_SHIFT
#define MSCAN_TDLR_DLC(x)            MSCAN_TDLR_TDLC(x)
#define I2C_S_REG(base)              I2C_S1_REG(base)
#define I2C_S_RXAK_MASK              I2C_S1_RXAK_MASK
#define I2C_S_RXAK_SHIFT             I2C_S1_RXAK_SHIFT
#define I2C_S_IICIF_MASK             I2C_S1_IICIF_MASK
#define I2C_S_IICIF_SHIFT            I2C_S1_IICIF_SHIFT
#define I2C_S_SRW_MASK               I2C_S1_SRW_MASK
#define I2C_S_SRW_SHIFT              I2C_S1_SRW_SHIFT
#define I2C_S_RAM_MASK               I2C_S1_RAM_MASK
#define I2C_S_RAM_SHIFT              I2C_S1_RAM_SHIFT
#define I2C_S_ARBL_MASK              I2C_S1_ARBL_MASK
#define I2C_S_ARBL_SHIFT             I2C_S1_ARBL_SHIFT
#define I2C_S_BUSY_MASK              I2C_S1_BUSY_MASK
#define I2C_S_BUSY_SHIFT             I2C_S1_BUSY_SHIFT
#define I2C_S_IAAS_MASK              I2C_S1_IAAS_MASK
#define I2C_S_IAAS_SHIFT             I2C_S1_IAAS_SHIFT
#define I2C_S_TCF_MASK               I2C_S1_TCF_MASK
#define I2C_S_TCF_SHIFT              I2C_S1_TCF_SHIFT
#define INT_PMC                      INT_LVD_LVW
#define INT_ADC                      INT_ADC0
#define INT_WDOG                     INT_WDOG_EWM
#define INT_Watchdog                 INT_WDOG_EWM

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MCU_MKE06Z4) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0100u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0100u) */
#endif  /* #if !defined(MCU_MKE06Z4) */

/* MKE06Z4.h, eof. */
